raagamounica@Mac fully-configurable % terraform plan 
module.resource_group.data.ibm_resource_group.default[0]: Reading...
data.ibm_iam_auth_token.auth_token: Reading...
data.ibm_iam_auth_token.auth_token: Read complete after 0s [id=2025-11-20 08:57:59.631884 +0000 UTC]
module.resource_group.data.ibm_resource_group.default[0]: Read complete after 2s [id=07b6d899988a4631841e3bc7d0307dcf]
module.scc_wp.ibm_resource_instance.scc_wp: Refreshing state... [id=crn:v1:bluemix:public:sysdig-secure:us-south:a/abac0df06b644a9cabc6e44f55b3880e:0b325063-081a-4b88-a78a-2df4f77fc788::]
module.scc_wp.data.ibm_iam_auth_token.token[0]: Reading...
module.scc_wp.data.ibm_iam_auth_token.token[0]: Read complete after 0s [id=2025-11-20 08:58:05.238087 +0000 UTC]
module.scc_wp.ibm_resource_key.scc_wp_resource_key: Refreshing state... [id=crn:v1:bluemix:public:sysdig-secure:us-south:a/abac0df06b644a9cabc6e44f55b3880e:0b325063-081a-4b88-a78a-2df4f77fc788:resource-key:4c81c5dc-c0e8-490f-8f6c-ec42ef893a0b]
module.scc_wp.module.trusted_profile_scc_wp[0].ibm_iam_trusted_profile.profile: Refreshing state... [id=Profile-17ff4015-818c-4c0b-b322-12aa255d3a34]
module.scc_wp.module.account_type_check[0].data.external.account_check: Reading...
module.scc_wp.module.account_type_check[0].data.external.account_check: Read complete after 1s [id=-]
module.scc_wp.module.trusted_profile_scc_wp[0].ibm_iam_trusted_profile_link.link["scc-wp-vsi-link-0"]: Refreshing state... [id=Profile-17ff4015-818c-4c0b-b322-12aa255d3a34/ClaimRule-52eb390a-9c0f-3623-a911-a92e8c8559e7]
module.scc_wp.module.trusted_profile_scc_wp[0].ibm_iam_trusted_profile_identity.trust_identity[0]: Refreshing state... [id=Profile-17ff4015-818c-4c0b-b322-12aa255d3a34|crn|crn:v1:bluemix:public:sysdig-secure:us-south:a/abac0df06b644a9cabc6e44f55b3880e:0b325063-081a-4b88-a78a-2df4f77fc788::]
module.scc_wp.module.trusted_profile_scc_wp[0].ibm_iam_trusted_profile_policy.policy["scc-wp"]: Refreshing state... [id=Profile-17ff4015-818c-4c0b-b322-12aa255d3a34/073c041a-3b79-41e9-83ca-dd8fe31d5e80]
module.scc_wp.module.trusted_profile_scc_wp[0].ibm_iam_trusted_profile_policy.policy["scc-wp-enterprise"]: Refreshing state... [id=Profile-17ff4015-818c-4c0b-b322-12aa255d3a34/596c168c-266d-494b-a38b-69b370546779]
module.scc_wp.restapi_object.cspm: Refreshing state... [id=crn:v1:bluemix:public:sysdig-secure:us-south:a/abac0df06b644a9cabc6e44f55b3880e:0b325063-081a-4b88-a78a-2df4f77fc788::]
 
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 
Terraform will perform the following actions:
 
  # module.scc_wp.restapi_object.cspm will be created
  + resource "restapi_object" "cspm" {
      + api_data                  = (known after apply)
      + api_response              = (known after apply)
      + create_method             = "PATCH"
      + create_response           = (known after apply)
      + data                      = jsonencode(
            {
              + parameters = {
                  + enable_cspm     = true
                  + target_accounts = [
                      + {
                          + account_id         = "abac0df06b644a9cabc6e44f55b3880e"
                          + account_type       = "ACCOUNT"
                          + config_crn         = "crn:v1:bluemix:public:apprapp:us-south:a/abac0df06b644a9cabc6e44f55b3880e:041f0216-37cc-472e-93b8-012f75d5c327::"
                          + trusted_profile_id = "Profile-17ff4015-818c-4c0b-b322-12aa255d3a34"
                        },
                    ]
                }
            }
        )
      + destroy_method            = "PATCH"
      + force_new                 = [
          + "true",
        ]
      + id                        = (known after apply)
      + ignore_all_server_changes = false
      + path                      = "/v2/resource_instances/0b325063-081a-4b88-a78a-2df4f77fc788"
      + update_method             = "PATCH"
    }
 
Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.scc_wp.module.trusted_profile_scc_wp[0].ibm_iam_trusted_profile_policy.policy["scc-wp"],
│   on .terraform/modules/scc_wp.trusted_profile_scc_wp/main.tf line 46, in resource "ibm_iam_trusted_profile_policy" "policy":
│   46:   profile_id         = ibm_iam_trusted_profile.profile.profile_id
│ 
│ This field is deprecated and will be removed starting with this 1.82.0 release. Please use iam_id field instead.


checked in terraform.state file it is not changing cloud_monitoring_instance
<img width="1460" height="114" alt="image" src="https://github.com/user-attachments/assets/a353f1f4-9328-447d-a2a7-fbb5a4658733" />
